Autodesk.Revit.DB.GeometryConversionOptions.IsValidPrioritiesForSolid(Autodesk.Revit.DB.GeometryTypeConversionPriorities)
Validates that the chosen priorities are valid for solids.
Returns:
True if the priorities are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.IsValidPrioritiesForMesh(Autodesk.Revit.DB.GeometryTypeConversionPriorities)
Validates that the chosen priorities are valid for meshes.
Returns:
True if the priorities are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.#ctor
Creates a default GeometryConversionOptions.
Since:
2022